app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."user_id" = ? ORDER BY "post_images"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "post_images" WHERE "post_images"."user_id" = ?  [["user_id", 1]]
---
  def show
  	@user = User.find(params[:id])
  	@post_images = @user.post_images.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "有澤　研人 aaa"], ["profile_image_id", "9cee813a92e3a67a19e25a43dac9dae5a94bd62097b03874c152bb102ffe"], ["updated_at", "2019-09-19 06:37:22.590252"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)